EDT/УТ/src/Documents/ФактическийПриходЗаказовНаСклад/ФактическийПриходЗаказовНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФактическийПриходЗаказовНаСклад</name>
  <basedOn>Document.ПриходЗаказовНаСклад</basedOn>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиЗаказов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияВыборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВСистеме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВПриходе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНаСканере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоЕстьВСистеме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоЕстьВПриходе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоЕстьНаСканере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВСистеме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВПриходе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаСканере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктРасхожденияПоПриходу</name>
    <type>
      <types>DocumentRef.АктРасхожденияПоПриходу_КУдалению</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереключательПоДате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалПриема</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненПоОжиданиюВАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперативнаяПриемкаЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АПП</name>
    <type>
      <types>DocumentRef.ПриходЗаказовНаСклад</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакРасхожденийСнятВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ФактическийПриходЗаказовНаСклад</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <comment>Порядковый</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИМЯндекса</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВСистеме</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВПриходе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНаСканере</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Брак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗаказа</name>
      <type>
        <types>CatalogRef.СостоянияЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВСистемеЗаполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВПриходеЗаполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНаСканереЗаполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМестПриход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМестСканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВСистеме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВПриходе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНаСканере</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВСистеме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПриходе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаСканере</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаУстановку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Расхождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПрихода</name>
      <type>
        <types>DocumentRef.ПриходЗаказовНаСклад</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТерминалДоставки</name>
      <type>
        <types>CatalogRef.РегиональныеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыТСД</name>
    <attributes>
      <name>ЗагрузкаСТСД</name>
      <type>
        <types>DocumentRef.ЗагрузкаСТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриходныеДокументы</name>
    <attributes>
      <name>Учитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходныйДокумент</name>
      <type>
        <types>DocumentRef.ПриходЗаказовНаСклад</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодтвержденныеПоступления</name>
    <attributes>
      <name>ПоступлениеТоваровУслуг</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыВременная</name>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВПриходе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНаСканере</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВПриходеЗаполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНаСканереЗаполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВПриходе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНаСканере</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПриходе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаСканере</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПрихода</name>
      <type>
        <types>DocumentRef.ПриходЗаказовНаСклад</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеопознанныеШК</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВСистеме</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияРеквизитов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучнаяКорректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/ФактическийПриходЗаказовНаСклад/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ВнешнийНомерЗаказаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(ВнешнийНомерЗаказа) Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ФактическийПриходЗаказовНаСкладЗаказы.Ссылка.Номер КАК Номер
		            |ИЗ
		            |	Документ.ФактическийПриходЗаказовНаСклад.Заказы КАК ФактическийПриходЗаказовНаСкладЗаказы
		            |ГДЕ
		            |	ФактическийПриходЗаказовНаСкладЗаказы.Заказ.НомерВнешнегоЗаказа = &НомерВнешнегоЗаказа
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ФактическийПриходЗаказовНаСкладЗаказы.Ссылка.Ссылка,
		            |	ФактическийПриходЗаказовНаСкладЗаказы.Ссылка.Номер";
		Зап.УстановитьПараметр("НомерВнешнегоЗаказа", ВнешнийНомерЗаказа);
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
		ИП = "Номер";
		ПЗ = Мас;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	// Вставить содержимое обработчика.
		ИП = "Номер";
		ПЗ = Новый Массив;
		Исп = Ложь;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
	//Список.Отбор.элементы[2].Использование = Ложь;
	ВнешнийНомерЗаказа = "";
	НомерЗаказа = "";
	Штрихкод = "";
КонецПроцедуры


&НаКлиенте
Процедура НомерЗаказаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ФактическийПриходЗаказовНаСкладЗаказы.Ссылка.Номер КАК Номер
		            |ИЗ
		            |	Документ.ФактическийПриходЗаказовНаСклад.Заказы КАК ФактическийПриходЗаказовНаСкладЗаказы
		            |ГДЕ
		            |	ФактическийПриходЗаказовНаСкладЗаказы.Заказ.Номер = &НомерЗаказа
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ФактическийПриходЗаказовНаСкладЗаказы.Ссылка.Ссылка,
		            |	ФактическийПриходЗаказовНаСкладЗаказы.Ссылка.Номер";
		Зап.УстановитьПараметр("НомерЗаказа", Формат(НомерЗаказа, "ЧГ="));
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
		ИП = "Номер";
		ПЗ = Мас;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры


#Область smv
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
   //Устанавливаем видимость/доступность кнопок в зависисмости от закрытия документа
   Если ЭтаФорма.ТекущийЭлемент = Элементы.Список Тогда
       //Элементы.СписокЗакрыт.Доступность = НЕ ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Закрыт;
       Элементы.ФормаСоздатьАктРасхождения.Доступность = НЕ ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Закрыт;
   КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  ЗакрытНаСервере(ДокументСсылка)
    ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
    Закрыт = ДокументОбъект.ЗакрытьДокумент();
    ДокументОбъект.Записать();
    Возврат Закрыт;
КонецФункции

//Закрывает документ
&НаКлиенте
Процедура Закрыт(Команда)
    ДокументСсылка = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока;
    Если НЕ ДокументСсылка.Закрыт Тогда
        Если НЕ ДокументСсылка.Проведен Тогда
            От = Вопрос("Для закрытия необходимо проведение документа. Провести?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
            Если От = КодВозвратаДиалога.Да Тогда
                ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
                ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
            Иначе
                Возврат;
            КонецеСли;
        КонецЕсли;
        Закрыт = ЗакрытНаСервере(ДокументСсылка);
        Если НЕ Закрыт Тогда
            Предупреждение("Есть расхождения, нельзя закрыть докумет!");
            Возврат;
        КонецЕсли;
    Иначе
        Закрыт = ЗакрытНаСервере(ДокументСсылка);
    КонецЕсли;
    
    //Закрыт = ЗакрытНаСервере(ДокументСсылка);
    //Если НЕ Закрыт Тогда
    //    Предупреждение("Есть расхождения, нельзя закрыть докумет!");
    //    Возврат;
    //КонецЕсли;
    
    //Устанавливаем видимость для кнопки создания акта
    Элементы.ФормаСоздатьАктРасхождения.Доступность = НЕ ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Закрыт;
    //Элементы.СписокЗакрыт.Доступность = НЕ ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Закрыт;
КонецПроцедуры

&НаСервере
Функция СоздатьАктРасхожденияНаСервере()
  ДокументОбъект = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.ПолучитьОбъект();
  Акт = ДокументОбъект.Создать_ОткрытьАктРасхожденияПоПриходу();
  ДокументОбъект.Записать();
  Возврат Акт; 
КонецФункции

//Создание/Открытие акта
&НаКлиенте
Процедура СоздатьАктРасхождения(Команда)
    Акт = СоздатьАктРасхожденияНаСервере();
    Если Акт <> Неопределено Тогда
    ОткрытьЗначение(Акт.Ссылка);
    Иначе
        Сообщить("Расходжений нет.", СтатусСообщения.Важное);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти
